import java.text.ParseException;
import java.util.Scanner;

public class StudentRun extends StudentService {
    static Student[] student = new Student[10];

    public static void main(String[] args) throws ParseException {
        student[0] = new Student("Булгаков", "Евгений", "Дмитриевич", "19-08-2000","Cокол-2","+380954442233", "Факультет прикладной математики", 5, "ПК-22м-1");
        student[1] = new Student("Бровко", "Анастасия", "Дмитриевна", "25-06-2001","Тополь-1","+380654242013", "Исторический факультет", 2, "ПК-20-2");
        student[2] = new Student("Готвянська", "Карина", "Павловна", "21-05-1999","Красный камень","+380957872031", "Факультет экономики", 3, "ПМ-18-1");
        student[3] = new Student("Зайцев", "Артур", "Дмитриевич", "30-02-2000","Сокол-1","+380665180021", "Физико-техничеcкий факультет", 5, "ПС-22-2");
        student[4] = new Student("Куц", "Никита", "Юриевич", "27-03-1999","Тополь-2","+380662542347", "Факультет прикладной математики", 2, "ПК-22м-1");
        student[5] = new Student("Лебеденко", "Антон", "Валерьевич", "13-10-2000","Дзержинского","+380984772299", "Факультет прикладной математики", 5, "ПК-22м-1");
        student[6] = new Student("Мосна", "Юлия", "Александровна", "05-01-2001","Приднепровск","+380955572311", "Факультет экономики", 4, "ПС-22-2");
        student[7] = new Student("Рябов", "Андрей", "Дмитриевич", "22-12-2000","Солнечный","+380668982288", "Факультет прикладной математики", 5, "ПМ-18-1");
        student[8] = new Student("Середняк", "Анастасия", "Борисовна", "07-07-2000","Гагарина","+380957412563", "Исторический факультет", 1, "ПК-22м-1");
        student[9] = new Student("Третьяк", "Елена", "Павловна", "09-05-1998","Тополь-1","+380676767020", "Факультет экономики", 4, "ЭК-20-1");

        System.out.println("Введите цифру: \n" +
                "1. Вывести список студентов заданного факультета. \n" +
                "2. Вывести списки студентов для факультета и курса.\n" +
                "3. Вывести список студентов, родившихся после заданного года (даты).\n" +
                "4. Вывести список учебной группы.\n" +
                "Warning: При вводе любой другой цифры/числа программа завершиться.");

        Scanner scanner = new Scanner(System.in);
        int select = scanner.nextInt();
        while (select >= 1 && select <= 4){
            switch (select) {
                case 1:
                    System.out.println("\nСписок студентов заданного факультета:");
                    listOfStudentsFaculty("Факультет прикладной математики");
                    break;
                case 2:
                    System.out.println("\nСписок студентовов заданного факультета и курса:");
                    listOfStudentsFacultyAndCourse("Факультет экономики", 4);
                    break;
                case 3:
                    System.out.println("\nСписок студентовов, родившихся после заданного года (даты):");
                    listOfStudentsBornAfterYear("18-08-2000");
                    break;
                case 4:
                    System.out.println("\nСписок учебной группы:");
                    studyGroupList("ПС-22-2");
                    break;
                default:
            }
            System.out.println("-----------------------------------------------------------------");
            select = scanner.nextInt();
        }
    }
}
